In [2]:
# %load rapid_imports.py
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

## Remove duplicates

In [6]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [10]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [13]:
data['v1'] = range(len(data))
data.drop_duplicates(['k2'], keep='last')

    k1  k2  v1
1  two   1   1
2  one   2   2
4  one   3   4
6  two   4   6

## Function mapping

In [57]:
 data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [58]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [63]:
lowercased_animal = data.food.str.lower()
data['animal'] = lowercased_animal.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Renaming

In [67]:
transform = lambda x: 'a' * (x + 1)

data_ren = data.copy()

to_names = lambda x: x.replace('_', ' ').title()
data_ren.columns = ['col_alpha', 'col_beta', 'col_gam_gamma']

data_ren.index = data_ren.index.map(transform)
# data_ren.columns = data_ren.columns.str.title()
data_ren.columns = data_ren.columns.map(to_names)
data_ren[:3]

       Col Alpha  Col Beta Col Gam Gamma
a          bacon       4.0           pig
aa   pulled pork       3.0           pig
aaa        bacon      12.0           pig

In [66]:
data.rename(index=transform, columns={'food': 'meal'})[:3]

            meal  ounces animal
a          bacon     4.0    pig
aa   pulled pork     3.0    pig
aaa        bacon    12.0    pig

## Binning

In [3]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins=bins, labels=group_names).value_counts()#.plot.bar(rot=0)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64